kc3hack/2026_team16/hardware/TimeFaker_TX_ESP32_BLEComplie.ver/src/main.cpp
/*
  ============================================================================
  ESP32-S3 Super Mini
  BLE Wi-Fi Provisioning + Conditional Web OTA + BLE Debug Monitor

  Document: CreatePlan.md v0.1 / SpecifcationDoc.md v0.2
  ============================================================================
*/

#include <WiFi.h>
#include <Update.h>
#include <Preferences.h>
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include <esp32-hal-rgb-led.h>

// =============================================================================
// Constants & Configuration
// =============================================================================

#ifndef LOG_SERIAL_ENABLED
#define LOG_SERIAL_ENABLED 1
#endif
#define SERIAL_BAUD 115200

// Wi-Fi
#define WIFI_SSID_MAX 32
#define WIFI_PASS_MAX 64

// Time Broadcast via BLE (TimeFaker)
#define BROADCAST_INTERVAL_MS 5000

// NTP Time Synchronization
#include <time.h>
const char *ntpServer = "pool.ntp.org";
const long gmtOffset_sec = 9 * 3600; // Japan GMT+9
const int daylightOffset_sec = 0;

// Status LED (ESP32-S3 Super Mini compatibility)
#define STATUS_LED_GPIO_PIN 47
#define STATUS_LED_RGB_PIN 48

// NVS Namespace
const char *NVS_WIFI_NS = "wifi";
const char *NVS_SYSCFG_NS = "syscfg";

// BLE Debug Service UUID (128-bit from spec)
#define DEBUG_SERVICE_UUID "7f3f0001-6b7c-4f2e-9b8a-1a2b3c4d5e6f"
#define DEBUG_LOG_TX_UUID "7f3f0002-6b7c-4f2e-9b8a-1a2b3c4d5e6f"
#define DEBUG_CMD_RX_UUID "7f3f0003-6b7c-4f2e-9b8a-1a2b3c4d5e6f"
#define DEBUG_STAT_UUID "7f3f0005-6b7c-4f2e-9b8a-1a2b3c4d5e6f"

// BLE Provisioning Service UUID
#define PROV_SERVICE_UUID "8f4f0001-7c8d-5f3e-ac9b-2b3c4d5e6f70"
#define PROV_WIFI_CONFIG_UUID "8f4f0002-7c8d-5f3e-ac9b-2b3c4d5e6f70"

// BLE OTA Service UUID
#define OTA_SERVICE_UUID "9f5f0001-8d9e-6f4e-bd0c-3c4d5e6f7180"
#define OTA_CONTROL_UUID "9f5f0002-8d9e-6f4e-bd0c-3c4d5e6f7180"
#define OTA_DATA_UUID "9f5f0003-8d9e-6f4e-bd0c-3c4d5e6f7180"
#define OTA_STATUS_UUID "9f5f0004-8d9e-6f4e-bd0c-3c4d5e6f7180"

// =============================================================================
// Global Variables
// =============================================================================

Preferences nvs_wifi;
Preferences nvs_syscfg;

// TimeFaker Time Broadcast
volatile int8_t currentOffset = 0; // Current offset in minutes
volatile bool offsetChanged = false;
volatile int fixedHour = 0; // Fixed time when offset was received
volatile int fixedMinute = 0;
volatile int fixedSecond = 0;
volatile bool useFixedTime = false; // Whether to use fixed time or current time

// State
typedef enum
{
    STATE_FACTORY_RESET_DETECT,
    STATE_PROVISIONING,
    STATE_APP_RUNNING,
} system_state_t;

typedef enum
{
    WIFI_IDLE = 0,
    WIFI_CONNECTING,
    WIFI_CONNECTED,
    WIFI_FAILED,
} wifi_state_t;

struct
{
    system_state_t system_state;
    wifi_state_t wifi_state;
    char wifi_ip[16];
    char device_name[32];
} g_state = {STATE_FACTORY_RESET_DETECT, WIFI_IDLE, "", ""};

// BLE
BLEServer *pServer = NULL;
BLECharacteristic *pDebugLogTx = NULL;
BLECharacteristic *pDebugCmdRx = NULL;
BLECharacteristic *pDebugStat = NULL;
BLECharacteristic *pProvWifiConfig = NULL;
BLECharacteristic *pOtaControl = NULL;
BLECharacteristic *pOtaData = NULL;
BLECharacteristic *pOtaStatus = NULL;

// OTA via BLE state
bool ota_mode_active = false;
size_t ota_expected_size = 0;
size_t ota_received_size = 0;
size_t ota_last_reported_size = 0;
bool ota_in_progress = false;
bool ota_finalize_requested = false;
bool ota_abort_requested = false;
bool provisioning_in_progress = false;

// Reboot management
bool reboot_requested = false;
unsigned long reboot_timestamp = 0;
const unsigned long REBOOT_DELAY_MS = 2000;

// Power saving: WiFi/OTA timeout after boot
unsigned long boot_timestamp = 0;
const unsigned long WIFI_OTA_TIMEOUT_MS = 60000; // 1 minute
bool wifi_ota_timeout_passed = false;
bool wifi_ota_timeout_deferred_logged = false;

void status_led_init()
{
    pinMode(STATUS_LED_GPIO_PIN, OUTPUT);
    digitalWrite(STATUS_LED_GPIO_PIN, HIGH);
    neopixelWrite(STATUS_LED_RGB_PIN, 0, 0, 0);
}

void status_led_blink_aws()
{
    digitalWrite(STATUS_LED_GPIO_PIN, LOW);
    neopixelWrite(STATUS_LED_RGB_PIN, 0, 24, 0);
    delay(120);
    digitalWrite(STATUS_LED_GPIO_PIN, HIGH);
    neopixelWrite(STATUS_LED_RGB_PIN, 0, 0, 0);
}

bool ble_device_connected = false;

void log_println(const char *msg);

// =============================================================================
// Utility Functions
// =============================================================================

void log_println(const char *msg)
{
    if (LOG_SERIAL_ENABLED)
    {
        Serial.println(msg);
        Serial.flush();
    }

    // Send via BLE if connected (real-time only) - but NOT during OTA or provisioning
    if (ble_device_connected && pDebugLogTx && !ota_in_progress && !provisioning_in_progress)
    {
        size_t len = strlen(msg);
        if (len > 0)
        {
            // BLE can send up to 512 bytes, but keep it safe at 200
            if (len > 200)
                len = 200;
            pDebugLogTx->setValue((uint8_t *)msg, len);
            pDebugLogTx->notify();
            delay(10); // Small delay to avoid overwhelming BLE stack
        }
    }
}

void setupNTP()
{
    log_println("[I] Setting up NTP time synchronization...");

    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);

    time_t now = time(nullptr);
    int attempts = 0;
    while (now < 24 * 3600 && attempts < 30)
    {
        delay(500);
        Serial.print(".");
        now = time(nullptr);
        attempts++;
    }

    Serial.println();
    if (now > 24 * 3600)
    {
        char time_msg[64];
        snprintf(time_msg, sizeof(time_msg), "[I] NTP sync success: %s", ctime(&now));
        log_println(time_msg);
    }
    else
    {
        log_println("[W] NTP sync timeout - using default time");
    }
}

void broadcastTimeNoId(int hh, int mm, int ss, int8_t offset_min)
{
    // Manufacturer Data payload (ID-less pattern for reception side pattern 2):
    // [0]:   Version (0x01)
    // [1]:   Hour (HH)
    // [2]:   Minute (MM)
    // [3]:   Second (SS)
    // [4]:   Offset in minutes (signed)
    // [5]:   Reserved
    uint8_t mfgData[6] = {
        0x01,                // Version
        (uint8_t)hh,         // Hour
        (uint8_t)mm,         // Minute
        (uint8_t)ss,         // Second
        (uint8_t)offset_min, // Offset (signed)
        0x01                 // Reserved (non-zero)
    };

