kc3hack/2026_team16/hardware/TimeFaker_TX_ESP32_BLEComplie.ver/src/main.cpp
    BLEAdvertisementData advData;
    std::string payload((char *)mfgData, sizeof(mfgData));
    advData.setManufacturerData(payload);
    advData.setName("TimeFaker_TX");

    BLEAdvertising *pAdv = BLEDevice::getAdvertising();
    BLEAdvertisementData scanData;
    scanData.setName("TimeFaker_TX");
    pAdv->stop();
    delay(5);
    pAdv->setAdvertisementData(advData);
    pAdv->setScanResponseData(scanData);
    pAdv->start();

    // Debug output - only to Serial
    Serial.print("[BROADCAST] ");
    Serial.print(hh < 10 ? "0" : "");
    Serial.print(hh);
    Serial.print(":");
    Serial.print(mm < 10 ? "0" : "");
    Serial.print(mm);
    Serial.print(":");
    Serial.print(ss < 10 ? "0" : "");
    Serial.print(ss);
    Serial.print(" offset=");
    if (offset_min >= 0)
        Serial.print("+");
    Serial.print(offset_min);
    Serial.print("min  [Payload: ");
    for (int i = 0; i < 6; i++)
    {
        if (mfgData[i] < 16)
            Serial.print("0");
        Serial.print(mfgData[i], HEX);
        Serial.print(" ");
    }
    Serial.println("]");
}

void updateBroadcast()
{
    // Only broadcast if fixed time has been set (offset received)
    if (!useFixedTime)
    {
        return; // Do not broadcast until offset is received
    }

    // Use fixed time captured when offset was received
    int hh = fixedHour;
    int mm = fixedMinute;
    int ss = fixedSecond;

    // Broadcast (ID-less pattern only)
    broadcastTimeNoId(hh, mm, ss, currentOffset);
}

void wifi_mgr_init(void)
{
    // Initialize Wi-Fi manager (non-blocking setup)
    WiFi.mode(WIFI_STA);
    g_state.wifi_state = WIFI_IDLE;
}

esp_err_t wifi_mgr_connect(void)
{
    if (g_state.wifi_state == WIFI_CONNECTING || g_state.wifi_state == WIFI_CONNECTED)
    {
        return ESP_OK;
    }

    char ssid[WIFI_SSID_MAX] = {0};
    char pass[WIFI_PASS_MAX] = {0};

    nvs_wifi.begin(NVS_WIFI_NS, true);
    size_t ssid_len = nvs_wifi.getString("ssid", ssid, sizeof(ssid));
    size_t pass_len = nvs_wifi.getString("pass", pass, sizeof(pass));
    nvs_wifi.end();

    if (ssid_len == 0)
    {
        log_println("[E] No Wi-Fi config found");
        g_state.wifi_state = WIFI_FAILED;
        return ESP_FAIL;
    }

    // Debug: Show what we're trying to connect to
    char debug_msg[128];
    snprintf(debug_msg, sizeof(debug_msg), "[I] Connecting to SSID: '%s' (len=%d, pass_len=%d)",
             ssid, ssid_len, pass_len);
    log_println(debug_msg);

    log_println("[I] Starting Wi-Fi connection...");
    g_state.wifi_state = WIFI_CONNECTING;

    WiFi.begin(ssid, pass);
    return ESP_OK;
}

bool wifi_mgr_is_connected(void)
{
    return g_state.wifi_state == WIFI_CONNECTED;
}

const char *wifi_mgr_get_ip_str(void)
{
    return g_state.wifi_ip;
}

// =============================================================================
// BLE Callback Classes
// =============================================================================

class MyServerCallbacks : public BLEServerCallbacks
{
    void onConnect(BLEServer *pServer)
    {
        ble_device_connected = true;
        log_println("[I] BLE device connected");

        // Send initial status immediately on connection
        delay(100); // Give BLE stack time to settle

        char status[128];
        snprintf(status, sizeof(status), "[STATUS] WIFI=%d, OTA=%s",
                 g_state.wifi_state,
                 ota_mode_active ? "ACTIVE" : "IDLE");
        log_println(status);
    }

    void onDisconnect(BLEServer *pServer)
    {
        ble_device_connected = false;
        log_println("[I] BLE device disconnected");
    }
};

class MyCharacteristicCallbacks : public BLECharacteristicCallbacks
{
    void onWrite(BLECharacteristic *pCharacteristic)
    {
        std::string rxValue = pCharacteristic->getValue();
        if (rxValue.length() > 0)
        {
            String command = String(rxValue.c_str());
            command.trim();

            // Log via BLE as well
            char ble_log[128];
            snprintf(ble_log, sizeof(ble_log), "[BLE RX] %s", command.c_str());
            log_println(ble_log);
            Serial.println("[BLE RX] Command received via Serial");

            // Check if this is an offset value (numeric input)
            bool is_numeric = true;
            if (command.length() > 0)
            {
                for (int i = 0; i < command.length(); i++)
                {
                    if (i == 0 && (command[i] == '-' || command[i] == '+'))
                        continue;
                    if (!isdigit(command[i]))
                    {
                        is_numeric = false;
                        break;
                    }
                }
            }

            if (is_numeric && command.length() > 0)
            {
                // Parse as offset value
                int offset = command.toInt();

                // Validate range
                if (offset < -120 || offset > 120)
                {
                    log_println("[E] Offset out of range (-120 to +120)");
                }
                else
                {
                    // Capture current time when offset is received
                    time_t now = time(nullptr);
                    struct tm *timeinfo = localtime(&now);
                    fixedHour = timeinfo->tm_hour;
                    fixedMinute = timeinfo->tm_min;
                    fixedSecond = timeinfo->tm_sec;

                    currentOffset = offset;
                    offsetChanged = true;
                    useFixedTime = true;

                    char offset_info[128];
                    snprintf(offset_info, sizeof(offset_info),
                             "[I] Time offset set to: %+d minutes at %02d:%02d:%02d",
                             offset, fixedHour, fixedMinute, fixedSecond);
                    log_println(offset_info);

                    // Blink status LED as confirmation
                    digitalWrite(STATUS_LED_GPIO_PIN, LOW);
                    delay(100);
                    digitalWrite(STATUS_LED_GPIO_PIN, HIGH);
                }
            }
            else if (command == "RESET_NVS" || command == "FACTORY_RESET")
            {
                log_println("[I] Factory reset requested via BLE");
                log_println("[I] Clearing NVS...");

                // Clear all NVS namespaces
                nvs_wifi.begin(NVS_WIFI_NS, false);
                nvs_wifi.clear();
                nvs_wifi.end();

                nvs_syscfg.begin(NVS_SYSCFG_NS, false);
                nvs_syscfg.clear();
                nvs_syscfg.end();

                log_println("[I] NVS cleared. Rebooting in 2 seconds...");

                // Schedule reboot
                reboot_requested = true;
                reboot_timestamp = millis();
            }
            else if (command == "STATUS")
            {
                log_println("[I] Status requested");
                char msg[128];
                snprintf(msg, sizeof(msg), "[I] STATE=%d,WIFI=%d,OTA_MODE=%d,IP=%s,OFFSET=%+d",
                         g_state.system_state, g_state.wifi_state, ota_mode_active ? 1 : 0,
                         g_state.wifi_ip, currentOffset);
                log_println(msg);
            }
            else if (command == "OTA_MODE")
            {
                log_println("[I] OTA mode activation requested via BLE");
                ota_mode_active = true;
                log_println("[I] OTA mode activated - ready to receive firmware data");
            }
        }
    }
};

class ProvisioningCallbacks : public BLECharacteristicCallbacks
{
    void onWrite(BLECharacteristic *pCharacteristic)
    {
        // Check if WiFi/OTA timeout has passed
        if (wifi_ota_timeout_passed)
        {
            log_println("[W] WiFi provisioning disabled after 60s timeout");
            return;
        }

        // Set flag to suppress BLE log output during provisioning
        provisioning_in_progress = true;

        std::string rxValue = pCharacteristic->getValue();
        if (rxValue.length() == 0)
        {
            log_println("[E] Empty provisioning data");
            provisioning_in_progress = false;
            return;
        }

