kc3hack/2026_team16/hardware/TimeFaker_TX_ESP32_BLEComplie.ver/src/main.cpp
        // Format: SSID\nPassword (separated by newline)
        String data = String(rxValue.c_str());
        int separatorIndex = data.indexOf('\n');

        if (separatorIndex == -1)
        {
            log_println("[E] Invalid provisioning format (no separator)");
            provisioning_in_progress = false;
            return;
        }

        String ssid = data.substring(0, separatorIndex);
        String password = data.substring(separatorIndex + 1);

        if (ssid.length() == 0 || ssid.length() > WIFI_SSID_MAX)
        {
            log_println("[E] Invalid SSID length");
            provisioning_in_progress = false;
            return;
        }

        if (password.length() > WIFI_PASS_MAX)
        {
            log_println("[E] Invalid password length");
            provisioning_in_progress = false;
            return;
        }

        log_println("[I] Received Wi-Fi credentials via BLE");

        // Log SSID and lengths (Serial only during provisioning)
        char ssid_info[128];
        snprintf(ssid_info, sizeof(ssid_info), "[I] SSID: %s", ssid.c_str());
        log_println(ssid_info);

        char len_info[64];
        snprintf(len_info, sizeof(len_info), "[I] SSID length: %d", ssid.length());
        log_println(len_info);

        snprintf(len_info, sizeof(len_info), "[I] Password length: %d", password.length());
        log_println(len_info);

        // Save to NVS
        nvs_wifi.begin(NVS_WIFI_NS, false);
        nvs_wifi.putString("ssid", ssid.c_str());
        nvs_wifi.putString("pass", password.c_str());
        nvs_wifi.end();

        // Verify what was saved
        char verify_ssid[WIFI_SSID_MAX] = {0};
        nvs_wifi.begin(NVS_WIFI_NS, true);
        size_t verify_len = nvs_wifi.getString("ssid", verify_ssid, sizeof(verify_ssid));
        nvs_wifi.end();

        char verify_info[128];
        snprintf(verify_info, sizeof(verify_info), "[I] Verified saved SSID: %s", verify_ssid);
        log_println(verify_info);

        snprintf(verify_info, sizeof(verify_info), "[I] Verified SSID length: %d", verify_len);
        log_println(verify_info);

        // Mark as provisioned
        nvs_syscfg.begin(NVS_SYSCFG_NS, false);
        nvs_syscfg.putUChar("prov", 1);
        nvs_syscfg.end();

        log_println("[I] Wi-Fi config saved! Device will reboot in 2 seconds...");

        // Clear flag to allow final log messages to be sent via BLE
        provisioning_in_progress = false;

        // Request reboot (will be executed in main loop after callback returns)
        // This ensures BLE write response is sent back to client before reboot
        reboot_requested = true;
        reboot_timestamp = millis();

        log_println("[I] Reboot scheduled...");
    }
};

// =============================================================================
// BLE OTA Callbacks
// =============================================================================

class OtaControlCallbacks : public BLECharacteristicCallbacks
{
    void onWrite(BLECharacteristic *pCharacteristic)
    {
        std::string rxValue = pCharacteristic->getValue();
        if (rxValue.length() == 0)
        {
            log_println("[E] Empty OTA control data");
            return;
        }

        String command = String(rxValue.c_str());
        command.trim();

        String msg = "[OTA] Control command: " + command;
        log_println(msg.c_str());

        // Check if WiFi/OTA timeout has passed
        // Allow END/ABORT for in-progress session even after timeout
        bool is_end_or_abort = (command == "END" || command == "ABORT");
        if (wifi_ota_timeout_passed && !(is_end_or_abort && ota_in_progress))
        {
            log_println("[W] OTA mode disabled after 60s timeout");
            if (pOtaStatus)
            {
                pOtaStatus->setValue("ERROR:TIMEOUT");
                pOtaStatus->notify();
            }
            return;
        }

        // Format: START:<size> or END
        if (command.startsWith("START:"))
        {
            size_t size = command.substring(6).toInt();
            if (size == 0 || size > 2000000) // Max 2MB
            {
                log_println("[E] Invalid OTA size");
                if (pOtaStatus)
                {
                    pOtaStatus->setValue("ERROR:INVALID_SIZE");
                    pOtaStatus->notify();
                }
                return;
            }

            log_println("[OTA] Starting OTA update...");
            Serial.printf("[OTA] Expected size: %u bytes\n", size);

            ota_expected_size = size;
            ota_received_size = 0;
            ota_last_reported_size = 0;
            ota_in_progress = true;
            ota_finalize_requested = false;
            ota_abort_requested = false;

            if (!Update.begin(size, U_FLASH))
            {
                Update.printError(Serial);
                log_println("[E] Update.begin() failed");
                ota_in_progress = false;
                if (pOtaStatus)
                {
                    pOtaStatus->setValue("ERROR:BEGIN_FAILED");
                    pOtaStatus->notify();
                }
                return;
            }

            log_println("[I] OTA update started successfully");
            if (pOtaStatus)
            {
                pOtaStatus->setValue("READY");
                pOtaStatus->notify();
            }
        }
        else if (command == "END")
        {
            if (!ota_in_progress)
            {
                log_println("[E] OTA not in progress");
                if (pOtaStatus)
                {
                    pOtaStatus->setValue("ERROR:NOT_STARTED");
                    pOtaStatus->notify();
                }
                return;
            }

            if (ota_received_size != ota_expected_size)
            {
                char err[64];
                snprintf(err, sizeof(err), "[E] OTA incomplete: %u / %u", ota_received_size, ota_expected_size);
                log_println(err);
                if (pOtaStatus)
                {
                    pOtaStatus->setValue("ERROR:INCOMPLETE");
                    pOtaStatus->notify();
                }
                return;
            }

