kc3hack/2026_team16/hardware/TimeFaker_TX_ESP32_BLEComplie.ver/src/main.cpp
            log_println("[OTA] Finalize requested - will process in main loop");
            ota_finalize_requested = true;
        }
        else if (command == "ABORT")
        {
            log_println("[W] OTA abort requested by user");
            ota_abort_requested = true;
        }
    }
};

class OtaDataCallbacks : public BLECharacteristicCallbacks
{
    void onWrite(BLECharacteristic *pCharacteristic)
    {
        if (!ota_in_progress)
        {
            log_println("[E] OTA not started, ignoring data");
            return;
        }

        std::string rxValue = pCharacteristic->getValue();
        size_t len = rxValue.length();

        if (len == 0)
        {
            log_println("[E] Empty OTA data packet");
            return;
        }

        if (ota_received_size + len > ota_expected_size)
        {
            log_println("[E] OTA data overflow (received more than expected)");
            Update.abort();
            ota_in_progress = false;
            ota_mode_active = false;

            if (pOtaStatus)
            {
                pOtaStatus->setValue("ERROR:OVERFLOW");
                pOtaStatus->notify();
            }
            return;
        }

        // Write data to flash
        size_t written = Update.write((uint8_t *)rxValue.data(), len);
        if (written != len)
        {
            Update.printError(Serial);
            log_println("[E] OTA write failed");
            Update.abort();
            ota_in_progress = false;

            if (pOtaStatus)
            {
                pOtaStatus->setValue("ERROR:WRITE_FAILED");
                pOtaStatus->notify();
            }
            return;
        }

        ota_received_size += written;

        // Progress notification every 100KB or at completion (reduce overhead)
        if (ota_received_size - ota_last_reported_size >= 102400 || ota_received_size == ota_expected_size)
        {
            ota_last_reported_size = ota_received_size;
            Serial.printf("[OTA] Progress: %u / %u bytes (%.1f%%)\n",
                          ota_received_size, ota_expected_size,
                          (ota_received_size * 100.0) / ota_expected_size);

            // Only notify progress occasionally to reduce BLE stack load
            if (pOtaStatus && (ota_received_size % 204800 == 0 || ota_received_size == ota_expected_size))
            {
                char progress[32];
                snprintf(progress, sizeof(progress), "PROGRESS:%u/%u",
                         ota_received_size, ota_expected_size);
                pOtaStatus->setValue(progress);
                pOtaStatus->notify();
            }
        }
    }
};

// =============================================================================
// BLE Setup
// =============================================================================

void setup_ble_debug_service(void)
{
    BLEService *pService = pServer->createService(DEBUG_SERVICE_UUID);

    // DebugLogTx (Notify)
    pDebugLogTx = pService->createCharacteristic(
        DEBUG_LOG_TX_UUID,
        BLECharacteristic::PROPERTY_NOTIFY);
    pDebugLogTx->addDescriptor(new BLE2902());

    // DebugCmdRx (Write)
    pDebugCmdRx = pService->createCharacteristic(
        DEBUG_CMD_RX_UUID,
        BLECharacteristic::PROPERTY_WRITE |
            BLECharacteristic::PROPERTY_WRITE_NR);
    pDebugCmdRx->setCallbacks(new MyCharacteristicCallbacks());

    // DebugStat (Read/Notify)
    pDebugStat = pService->createCharacteristic(
        DEBUG_STAT_UUID,
        BLECharacteristic::PROPERTY_READ |
            BLECharacteristic::PROPERTY_NOTIFY);
    pDebugStat->addDescriptor(new BLE2902());

    pService->start();
}

void setup_ble_provisioning_service(void)
{
    BLEService *pProvService = pServer->createService(PROV_SERVICE_UUID);

    // WiFi Config (Write)
    pProvWifiConfig = pProvService->createCharacteristic(
        PROV_WIFI_CONFIG_UUID,
        BLECharacteristic::PROPERTY_WRITE |
            BLECharacteristic::PROPERTY_WRITE_NR);
    pProvWifiConfig->setCallbacks(new ProvisioningCallbacks());

    pProvService->start();
    log_println("[I] BLE Provisioning service started");
}

void setup_ble_ota_service(void)
{
    BLEService *pOtaService = pServer->createService(OTA_SERVICE_UUID);

    // OTA Control (Write) - for START, END, ABORT commands
    pOtaControl = pOtaService->createCharacteristic(
        OTA_CONTROL_UUID,
        BLECharacteristic::PROPERTY_WRITE |
            BLECharacteristic::PROPERTY_WRITE_NR);
    pOtaControl->setCallbacks(new OtaControlCallbacks());

    // OTA Data (Write) - for firmware binary data
    pOtaData = pOtaService->createCharacteristic(
        OTA_DATA_UUID,
        BLECharacteristic::PROPERTY_WRITE |
            BLECharacteristic::PROPERTY_WRITE_NR);
    pOtaData->setCallbacks(new OtaDataCallbacks());
    pOtaData->setValue((uint8_t *)"", 0); // Initialize empty

    // OTA Status (Read/Notify) - for progress and status updates
    pOtaStatus = pOtaService->createCharacteristic(
        OTA_STATUS_UUID,
        BLECharacteristic::PROPERTY_READ |
            BLECharacteristic::PROPERTY_NOTIFY);
    pOtaStatus->addDescriptor(new BLE2902());
    pOtaStatus->setValue("IDLE");

    pOtaService->start();
    log_println("[I] BLE OTA service started");
}

void init_ble(void)
{
    log_println("[I] Starting BLE device init...");
    BLEDevice::init("ESP32-S3-MICON");

    // Request larger MTU for better OTA throughput
    BLEDevice::setMTU(517);

    log_println("[I] BLE device initialized");

    delay(100);

    log_println("[I] Creating BLE server...");
    pServer = BLEDevice::createServer();
    pServer->setCallbacks(new MyServerCallbacks());
    log_println("[I] BLE server created");

    log_println("[I] Setting up debug service...");
    setup_ble_debug_service();
    log_println("[I] Debug service ready");

    // Setup OTA service (always available)
    log_println("[I] Setting up OTA service...");
    setup_ble_ota_service();

    // Setup provisioning service (always available for WiFi re-provisioning during operation)
    log_println("[I] Setting up provisioning service...");
    setup_ble_provisioning_service();

    log_println("[I] Starting advertising...");
    BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
    pAdvertising->addServiceUUID(DEBUG_SERVICE_UUID);
    pAdvertising->addServiceUUID(OTA_SERVICE_UUID);
    pAdvertising->addServiceUUID(PROV_SERVICE_UUID); // Always advertise provisioning service
    pAdvertising->setScanResponse(true);
    pAdvertising->setMinPreferred(0x06);
    pAdvertising->setMaxPreferred(0x12);
    BLEDevice::startAdvertising();

