kc3hack/2026_team16/hardware/TimeFaker_TX_ESP32_BLEComplie.ver/src/main.cpp
    log_println("[I] BLE initialized successfully");
}

// =============================================================================
// Factory Reset / NVS Management
// =============================================================================

void config_store_init(void)
{
    nvs_wifi.begin(NVS_WIFI_NS, false);
    nvs_syscfg.begin(NVS_SYSCFG_NS, false);
}

void config_store_check_provisioned(void)
{
    nvs_wifi.begin(NVS_WIFI_NS, true);
    uint8_t is_provisioned = nvs_wifi.getUChar("prov", 0);
    nvs_wifi.end();

    if (is_provisioned)
    {
        log_println("[I] Wi-Fi config found, entering APP mode");
        g_state.system_state = STATE_APP_RUNNING;
    }
    else
    {
        log_println("[I] No Wi-Fi config, entering PROVISIONING mode");
        g_state.system_state = STATE_PROVISIONING;
    }
}

void factory_reset_check(void)
{
    // Simplified: Check if BOOT button held for 3 seconds
    // In real implementation, use GPIO interrupt
    // For now, just check a flag in preferences

    nvs_syscfg.begin(NVS_SYSCFG_NS, true);
    uint8_t factory_reset_flag = nvs_syscfg.getUChar("factory_reset", 0);
    nvs_syscfg.end();

    if (factory_reset_flag)
    {
        log_println("[W] Factory reset triggered!");
        nvs_wifi.begin(NVS_WIFI_NS, false);
        nvs_wifi.clear();
        nvs_wifi.end();

        nvs_syscfg.begin(NVS_SYSCFG_NS, false);
        nvs_syscfg.putUChar("factory_reset", 0);
        nvs_syscfg.end();

        log_println("[I] NVS cleared, rebooting...");
        delay(1000);
        ESP.restart();
    }
}

// =============================================================================
// Wi-Fi Event Handler
// =============================================================================

void wifi_event_handler(WiFiEvent_t event)
{
    switch (event)
    {
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
        log_println("[I] Wi-Fi connected");
        break;

    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    {
        g_state.wifi_state = WIFI_CONNECTED;
        IPAddress ip = WiFi.localIP();
        snprintf(g_state.wifi_ip, sizeof(g_state.wifi_ip), "%d.%d.%d.%d",
                 ip[0], ip[1], ip[2], ip[3]);

        char msg[64];
        snprintf(msg, sizeof(msg), "[I] Got IP: %s", g_state.wifi_ip);
        log_println(msg);

        // Start NTP synchronization after WiFi is connected
        setupNTP();

        // If in provisioning mode, mark as provisioned
        if (g_state.system_state == STATE_PROVISIONING)
        {
            nvs_wifi.begin(NVS_WIFI_NS, false);
            nvs_wifi.putUChar("prov", 1);
            nvs_wifi.end();

            log_println("[I] WiFi provisioned successfully");
            g_state.system_state = STATE_APP_RUNNING;
        }
        break;
    }

    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    {
        g_state.wifi_state = WIFI_FAILED;

        // Get detailed disconnect reason
        char reason_msg[128];
        snprintf(reason_msg, sizeof(reason_msg),
                 "[W] Wi-Fi disconnected (status=%d)", WiFi.status());
        log_println(reason_msg);

        // Additional debug info
        if (WiFi.status() == WL_NO_SSID_AVAIL)
        {
            log_println("[E] SSID not found - check if SSID is correct");
        }
        else if (WiFi.status() == WL_CONNECT_FAILED)
        {
            log_println("[E] Connection failed - check password");
        }
        break;
    }

    default:
        break;
    }
}

// =============================================================================
// Setup
// =============================================================================

void setup()
{
    boot_timestamp = millis(); // Record boot time for power-saving mode

    Serial.begin(SERIAL_BAUD);
    delay(500);

    // Boot sequence with repeated messages - allows time to catch output after USB reconnect
    Serial.println("\n\n=== ESP32-S3 BOOT SEQUENCE STARTING ===");
    Serial.println("=== Waiting 5 seconds for monitor to connect... ===\n");

    for (int i = 5; i > 0; i--)
    {
        Serial.print("[BOOT] ");
        Serial.print(i);
        Serial.println(" seconds until initialization continues...");
        delay(1000);
    }

    Serial.println("\n=== Proceeding with initialization ===\n");

    // Direct output to confirm serial is working
    Serial.println("=== ESP32-S3 Booting ===");
    Serial.println("=== If you see this, application started! ===");

#ifdef LOG_SERIAL_ENABLED
    Serial.println("LOG_SERIAL_ENABLED is defined");
#else
    Serial.println("WARNING: LOG_SERIAL_ENABLED is NOT defined");
#endif

    log_println("\n\n[System] ESP32-S3 Starting...");
    log_println("[Version] FW v1.0.0");

    // Initialize components - add checkpoint logging
    Serial.println("[CHECKPOINT] Calling config_store_init...");
    config_store_init();
    Serial.println("[CHECKPOINT] config_store_init done");

    Serial.println("[CHECKPOINT] Calling factory_reset_check...");
    factory_reset_check();
    Serial.println("[CHECKPOINT] factory_reset_check done");

    Serial.println("[CHECKPOINT] Calling config_store_check_provisioned...");
    config_store_check_provisioned();
    Serial.println("[CHECKPOINT] config_store_check_provisioned done");

    log_println("[Setup] Initializing WiFi...");
    wifi_mgr_init();

    // Setup status LED
    status_led_init();

    delay(500); // Give time for WiFi stack to initialize

    log_println("[Setup] Initializing BLE...");
    init_ble();

    delay(500); // Give time for BLE stack to initialize

    // WiFi event handler
    WiFi.onEvent(wifi_event_handler);

    snprintf(g_state.device_name, sizeof(g_state.device_name), "ESP32-S3-SUPERMINI");

    log_println("[Setup] Initialization complete");
    log_println("[Info] Waiting for BLE provisioning or app commands...");
}

// =============================================================================
// Loop
// =============================================================================

void loop()
{
    // Handle reboot request (e.g., after WiFi provisioning)
    if (reboot_requested)
    {
        unsigned long elapsed = millis() - reboot_timestamp;
        if (elapsed >= REBOOT_DELAY_MS)
        {
            log_println("[I] Rebooting now...");
            delay(100); // Give time for final log to be sent
            ESP.restart();
        }
        // Don't process other operations while reboot is pending
        return;
    }

    // Handle OTA finalization request (moved from BLE callback to avoid stack issues)
    if (ota_finalize_requested)
    {
        ota_finalize_requested = false;

