kc3hack/2026_team16/hardware/TimeFaker_TX_ESP32_BLEComplie.ver/src/main.cpp
        log_println("[OTA] Finalizing update...");
        Serial.printf("[OTA] Received: %u bytes / Expected: %u bytes\n", ota_received_size, ota_expected_size);

        if (Update.end(true)) // true = do checksum validation
        {
            Serial.printf("[OTA] Update Success: %u bytes\n", ota_received_size);
            log_println("[I] OTA update successful!");
            ota_in_progress = false;
            ota_mode_active = false;

            if (pOtaStatus)
            {
                pOtaStatus->setValue("SUCCESS");
                pOtaStatus->notify();
            }

            delay(1000);
            log_println("[I] Rebooting...");
            delay(500);
            ESP.restart();
        }
        else
        {
            Serial.println("\n=== Update.end() FAILED ===");
            Serial.printf("[OTA] ota_received_size = %u\n", ota_received_size);
            Serial.printf("[OTA] ota_expected_size = %u\n", ota_expected_size);
            Update.printError(Serial);
            log_println("[E] Update.end() failed");
            ota_in_progress = false;

            if (pOtaStatus)
            {
                pOtaStatus->setValue("ERROR:END_FAILED");
                pOtaStatus->notify();
            }
        }
    }

    // Handle OTA abort request
    if (ota_abort_requested)
    {
        ota_abort_requested = false;
        log_println("[W] OTA aborted by user");
        if (ota_in_progress)
        {
            Update.abort();
            ota_in_progress = false;
        }
        ota_mode_active = false;

        if (pOtaStatus)
        {
            pOtaStatus->setValue("ABORTED");
            pOtaStatus->notify();
        }
    }

    // Check if WiFi/OTA timeout has passed (60 seconds after boot)
    if (!wifi_ota_timeout_passed && (millis() - boot_timestamp >= WIFI_OTA_TIMEOUT_MS))
    {
        // Do not interrupt ongoing OTA write. Defer timeout activation.
        if (ota_in_progress)
        {
            if (!wifi_ota_timeout_deferred_logged)
            {
                log_println("[I] OTA timeout deferred while write is in progress");
                wifi_ota_timeout_deferred_logged = true;
            }
        }
        else
        {
            wifi_ota_timeout_passed = true;
            log_println("[I] === OTA timeout activated ===");
            log_println("[I] OTA and WiFi provisioning disabled after 60s");
            log_println("[I] WiFi connection will be maintained");

            // Disable OTA mode if active (only when not writing)
            if (ota_mode_active)
            {
                log_println("[W] Disabling OTA mode (timeout)");
                ota_mode_active = false;
            }
        }
    }

    // If OTA mode is active, stop normal app operation
    if (ota_mode_active)
    {
        // Only handle BLE and OTA processing
        delay(10); // Reduced delay for faster response
        return;
    }

    // Wi-Fi state monitoring and auto-reconnect management
    static unsigned long last_wifi_check = 0;
    static unsigned long last_wifi_reconnect_try = 0;
    static unsigned long wifi_connect_start_time = 0;

    if (millis() - last_wifi_check > 5000) // Check WiFi state every 5 seconds
    {
        last_wifi_check = millis();

        if (g_state.wifi_state == WIFI_CONNECTING)
        {
            if (WiFi.status() == WL_CONNECTED)
            {
                // Will be handled by event handler
            }
            else
            {
                // Check for connection timeout (30 seconds)
                if (wifi_connect_start_time > 0 &&
                    (millis() - wifi_connect_start_time > 30000))
                {
                    log_println("[E] WiFi connection timeout - marking as failed");
                    g_state.wifi_state = WIFI_FAILED;
                    wifi_connect_start_time = 0;
                    WiFi.disconnect();
                }
            }
        }

        // Auto-reconnect: if WiFi config exists but not connected, try to connect
        if ((g_state.wifi_state == WIFI_IDLE || g_state.wifi_state == WIFI_FAILED) &&
            (millis() - last_wifi_reconnect_try > 30000)) // Retry every 30 seconds
        {
            char ssid[WIFI_SSID_MAX] = {0};
            nvs_wifi.begin(NVS_WIFI_NS, true);
            size_t ssid_len = nvs_wifi.getString("ssid", ssid, sizeof(ssid));
            nvs_wifi.end();

            if (ssid_len > 0) // WiFi config exists
            {
                log_println("[I] Loop: WiFi config found, initiating connection...");
                last_wifi_reconnect_try = millis();
                wifi_connect_start_time = millis();
                wifi_mgr_connect();
            }
        }
        else if (g_state.wifi_state == WIFI_CONNECTING && wifi_connect_start_time == 0)
        {
            // Initialize connection start time if not set
            wifi_connect_start_time = millis();
        }
    }

    // BLE Output: Broadcast current time with offset via BLE every 5 seconds
    static unsigned long last_broadcast = 0;
    if (millis() - last_broadcast >= BROADCAST_INTERVAL_MS)
    {
        last_broadcast = millis();
        updateBroadcast();
        offsetChanged = false;

        // Blink status LED when broadcasting
        status_led_blink_aws();
    }

    // Every 10 seconds, update BLE debug stat
    static unsigned long last_stat_update = 0;
    if (millis() - last_stat_update > 10000)
    {
        last_stat_update = millis();

        if (ble_device_connected && pDebugStat)
        {
            char stat_str[128];
            snprintf(stat_str, sizeof(stat_str),
                     "STATE:BLE=%d,WIFI=%d,OTA_MODE=%d,IP=%s,OFFSET=%+d",
                     ble_device_connected ? 1 : 0,
                     g_state.wifi_state,
                     ota_mode_active ? 1 : 0,
                     g_state.wifi_ip,
                     currentOffset);
            pDebugStat->setValue((uint8_t *)stat_str, strlen(stat_str));
            pDebugStat->notify();
        }
    }

    delay(100);
}
